src/config/Documents/ЗакрытиеЗаказовПоставщикамСезонных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ЗакрытиеЗаказовПоставщикамСезонных</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПоставщикамСезонные</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заказы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказПоставщикуСезонный</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщикуСезонный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/config/AccumulationRegisters/ЗаказыПоставщикамСезонные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПоставщикамСезонные</Name>
			<Comment>остатки товаров в производстве (Китай)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщикуСезонный</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщикуСезонный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВЭД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/AccumulationRegisters/ВзаиморасчетыСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентами</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателяСезонный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.АккредитивПереданный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеТребованиеПолученное</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнкассовоеПоручениеПолученное</v8:Type>
						<v8:Type>cfg:DocumentRef.Взаимозачет</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщикуИзНеавтоматизированнойТорговойТочки</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолгаПоВозвратнойТаре</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНеавтоматизированнуюТорговуюТочку</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеПени</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеТребованиеВыставленное</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.АккредитивПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоПрессФормам</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнкассовоеПоручениеПереданное</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/Documents/ЗакрытиеЗаказовПоставщикамСезонных/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.УстановитьПараметр("СписокЗаказов", Заказы.ВыгрузитьКолонку("ЗаказПоставщикуСезонный"));
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказыПоставщикамСезонныеОстатки.Номенклатура,
	               |	ЗаказыПоставщикамСезонныеОстатки.КоличествоОстаток,
	               |	ЗаказыПоставщикамСезонныеОстатки.ЗаказПоставщикуСезонный
	               |ИЗ
	               |	РегистрНакопления.ЗаказыПоставщикамСезонные.Остатки(&Период, ЗаказПоставщикуСезонный В (&СписокЗаказов)) КАК ЗаказыПоставщикамСезонныеОстатки
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЗаказыПоставщикамСезонныеОстатки.ЗаказПоставщикуСезонный
	               |АВТОУПОРЯДОЧИВАНИЕ";
				   
	Результат = Запрос.Выполнить().Выгрузить();
	Для каждого СтрЗаказ ИЗ Заказы Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("ЗаказПоставщикуСезонный", СтрЗаказ.ЗаказПоставщикуСезонный);
		СтрокиТЗ = Результат.НайтиСтроки(Отбор);
		Для Каждого СтрТЗ ИЗ СтрокиТЗ Цикл
			Движение = Движения.ЗаказыПоставщикамСезонные.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата; 
			Движение.ЗаказПоставщикуСезонный = СтрЗаказ.ЗаказПоставщикуСезонный;
			Движение.Номенклатура = СтрТЗ.Номенклатура;
			Движение.Количество   = СтрТЗ.КоличествоОстаток * (-1); //сторно
			Если СтрЗаказ.ЗаказПоставщикуСезонный.Дата >= Дата("20170101000000") Тогда
			Движение.Подразделение = СтрЗаказ.ЗаказПоставщикуСезонный.Подразделение; 
			Движение.ВЭД = СтрЗаказ.ЗаказПоставщикуСезонный.Подразделение.ВЭД;
			конецЕсли;
			Движение.Дата = Дата;
		КонецЦикла;
	КонецЦикла;	
	
	
	
	Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
	Движения.ВзаиморасчетыСКонтрагентами.Очистить();
	
	
	
	Сделки = Новый СписокЗначений;
	для каждого стр из Заказы Цикл
	Сделки.Добавить(стр.ЗаказПоставщикуСезонный.ЗаказДубль);	
	конецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток КАК СуммаВал,
	|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаУпрОстаток КАК СуммаРуб,
	|	ВзаиморасчетыСКонтрагентамиОстатки.Сделка КАК Заказ
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(&Дата, Сделка В (&Сделки)) КАК ВзаиморасчетыСКонтрагентамиОстатки";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("Сделки", Сделки);
	
	Результат = Запрос.Выполнить();
	
	Если не результат.Пустой()>0 Тогда	
		 НаборДвижений = Движения.ВзаиморасчетыСКонтрагентами;
	     ТаблицаДвижений = НаборДвижений.Выгрузить();
	     ТаблицаДвижений.Очистить();

		 выборка=Результат.Выбрать();
		пока Выборка.Следующий() Цикл 
		
		СтрокаДвижений = ТаблицаДвижений.Добавить();
		СтрокаДвижений.ДоговорКонтрагента  = Выборка.Заказ.Договорконтрагента;
		СтрокаДвижений.Сделка              = Выборка.Заказ;
		СтрокаДвижений.СуммаВзаиморасчетов = -Выборка.СуммаВал;
		СтрокаДвижений.СуммаУпр            = -Выборка.СуммаРуб;
		
		СтрокаДвижений = ТаблицаДвижений.Добавить();
		СтрокаДвижений.ДоговорКонтрагента  = Выборка.Заказ.Договорконтрагента;
		СтрокаДвижений.Сделка              = неопределено;
		СтрокаДвижений.СуммаВзаиморасчетов = Выборка.СуммаВал;
		СтрокаДвижений.СуммаУпр            = Выборка.СуммаРуб;
	   конецЦикла;
		НаборДвижений.мПериод            = дата;
		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
		Движения.ВзаиморасчетыСКонтрагентами.ВыполнитьПриход();
		
	конецЕсли;
	

КонецПроцедуры
